{
    "a1": 0,
    "a2": 1,
    "a3": 2,
    "a4": 3,
    "a5": 4,
    "ai1": 5,
    "ai2": 6,
    "ai3": 7,
    "ai4": 8,
    "ai5": 9,
    "an1": 10,
    "an2": 11,
    "an3": 12,
    "an4": 13,
    "ang1": 14,
    "ang2": 15,
    "ang4": 16,
    "ao1": 17,
    "ao2": 18,
    "ao3": 19,
    "ao4": 20,
    "ba1": 21,
    "ba2": 22,
    "ba3": 23,
    "ba4": 24,
    "ba5": 25,
    "bai1": 26,
    "bai2": 27,
    "bai3": 28,
    "bai4": 29,
    "bai5": 30,
    "ban1": 31,
    "ban2": 32,
    "ban3": 33,
    "ban4": 34,
    "ban5": 35,
    "bang1": 36,
    "bang2": 37,
    "bang3": 38,
    "bang4": 39,
    "bang5": 40,
    "bangr3": 41,
    "banr1": 42,
    "banr3": 43,
    "banr4": 44,
    "bao1": 45,
    "bao2": 46,
    "bao3": 47,
    "bao4": 48,
    "bao5": 49,
    "bar4": 50,
    "bar5": 51,
    "bei1": 52,
    "bei2": 53,
    "bei3": 54,
    "bei4": 55,
    "bei5": 56,
    "beir4": 57,
    "ben1": 58,
    "ben2": 59,
    "ben3": 60,
    "ben4": 61,
    "ben5": 62,
    "beng1": 63,
    "beng2": 64,
    "beng3": 65,
    "beng4": 66,
    "beng5": 67,
    "benr3": 68,
    "bi1": 69,
    "bi2": 70,
    "bi3": 71,
    "bi4": 72,
    "bi5": 73,
    "bian1": 74,
    "bian2": 75,
    "bian3": 76,
    "bian4": 77,
    "bian5": 78,
    "bianr1": 79,
    "biao1": 80,
    "biao2": 81,
    "biao3": 82,
    "biao4": 83,
    "biaor1": 84,
    "biaor3": 85,
    "bie1": 86,
    "bie2": 87,
    "bie3": 88,
    "bie4": 89,
    "bie5": 90,
    "bin1": 91,
    "bin2": 92,
    "bin3": 93,
    "bin4": 94,
    "bing1": 95,
    "bing2": 96,
    "bing3": 97,
    "bing4": 98,
    "bing5": 99,
    "bo1": 100,
    "bo2": 101,
    "bo3": 102,
    "bo4": 103,
    "bo5": 104,
    "bor1": 105,
    "bor2": 106,
    "bu1": 107,
    "bu2": 108,
    "bu3": 109,
    "bu4": 110,
    "bu5": 111,
    "ca1": 112,
    "ca2": 113,
    "ca3": 114,
    "ca4": 115,
    "cai1": 116,
    "cai2": 117,
    "cai3": 118,
    "cai4": 119,
    "cai5": 120,
    "cair3": 121,
    "can1": 122,
    "can2": 123,
    "can3": 124,
    "can4": 125,
    "cang1": 126,
    "cang2": 127,
    "cang3": 128,
    "cang4": 129,
    "cao1": 130,
    "cao2": 131,
    "cao3": 132,
    "cao4": 133,
    "cao5": 134,
    "caor3": 135,
    "ce1": 136,
    "ce3": 137,
    "ce4": 138,
    "ce5": 139,
    "cen1": 140,
    "cen2": 141,
    "cen4": 142,
    "ceng1": 143,
    "ceng2": 144,
    "ceng3": 145,
    "ceng4": 146,
    "cha1": 147,
    "cha2": 148,
    "cha3": 149,
    "cha4": 150,
    "cha5": 151,
    "chai1": 152,
    "chai2": 153,
    "chai3": 154,
    "chai4": 155,
    "chan1": 156,
    "chan2": 157,
    "chan3": 158,
    "chan4": 159,
    "chan5": 160,
    "chang1": 161,
    "chang2": 162,
    "chang3": 163,
    "chang4": 164,
    "chang5": 165,
    "chao1": 166,
    "chao2": 167,
    "chao3": 168,
    "chao4": 169,
    "chao5": 170,
    "char2": 171,
    "che1": 172,
    "che2": 173,
    "che3": 174,
    "che4": 175,
    "chen1": 176,
    "chen2": 177,
    "chen3": 178,
    "chen4": 179,
    "chen5": 180,
    "cheng1": 181,
    "cheng2": 182,
    "cheng3": 183,
    "cheng4": 184,
    "cheng5": 185,
    "chenr2": 186,
    "cher1": 187,
    "chi1": 188,
    "chi2": 189,
    "chi3": 190,
    "chi4": 191,
    "chi5": 192,
    "chong1": 193,
    "chong2": 194,
    "chong3": 195,
    "chong4": 196,
    "chong5": 197,
    "chou1": 198,
    "chou2": 199,
    "chou3": 200,
    "chou4": 201,
    "chou5": 202,
    "chu1": 203,
    "chu2": 204,
    "chu3": 205,
    "chu4": 206,
    "chu5": 207,
    "chuai1": 208,
    "chuai3": 209,
    "chuai4": 210,
    "chuan1": 211,
    "chuan2": 212,
    "chuan3": 213,
    "chuan4": 214,
    "chuan5": 215,
    "chuang1": 216,
    "chuang2": 217,
    "chuang3": 218,
    "chuang4": 219,
    "chuang5": 220,
    "chuanr1": 221,
    "chuanr4": 222,
    "chui1": 223,
    "chui2": 224,
    "chui4": 225,
    "chui5": 226,
    "chun1": 227,
    "chun2": 228,
    "chun3": 229,
    "chun5": 230,
    "chunr1": 231,
    "chuo1": 232,
    "chuo4": 233,
    "ci1": 234,
    "ci2": 235,
    "ci3": 236,
    "ci4": 237,
    "ci5": 238,
    "cir2": 239,
    "cong1": 240,
    "cong2": 241,
    "cong3": 242,
    "cong4": 243,
    "cong5": 244,
    "cou1": 245,
    "cou2": 246,
    "cou4": 247,
    "cu1": 248,
    "cu2": 249,
    "cu3": 250,
    "cu4": 251,
    "cu5": 252,
    "cuan1": 253,
    "cuan2": 254,
    "cuan4": 255,
    "cui1": 256,
    "cui2": 257,
    "cui3": 258,
    "cui4": 259,
    "cui5": 260,
    "cun1": 261,
    "cun2": 262,
    "cun3": 263,
    "cun4": 264,
    "cun5": 265,
    "cunr1": 266,
    "cuo1": 267,
    "cuo2": 268,
    "cuo3": 269,
    "cuo4": 270,
    "da1": 271,
    "da2": 272,
    "da3": 273,
    "da4": 274,
    "da5": 275,
    "dai1": 276,
    "dai2": 277,
    "dai3": 278,
    "dai4": 279,
    "dai5": 280,
    "dair4": 281,
    "dan1": 282,
    "dan2": 283,
    "dan3": 284,
    "dan4": 285,
    "dan5": 286,
    "dang1": 287,
    "dang2": 288,
    "dang3": 289,
    "dang4": 290,
    "danr3": 291,
    "dao1": 292,
    "dao2": 293,
    "dao3": 294,
    "dao4": 295,
    "dao5": 296,
    "daor4": 297,
    "dar2": 298,
    "de1": 299,
    "de2": 300,
    "de3": 301,
    "de4": 302,
    "de5": 303,
    "dei2": 304,
    "dei3": 305,
    "dei5": 306,
    "den1": 307,
    "den2": 308,
    "den3": 309,
    "deng1": 310,
    "deng2": 311,
    "deng3": 312,
    "deng4": 313,
    "deng5": 314,
    "der2": 315,
    "der5": 316,
    "di1": 317,
    "di2": 318,
    "di3": 319,
    "di4": 320,
    "di5": 321,
    "dia2": 322,
    "dia3": 323,
    "dian1": 324,
    "dian2": 325,
    "dian3": 326,
    "dian4": 327,
    "dian5": 328,
    "dianr2": 329,
    "dianr3": 330,
    "dianr4": 331,
    "dianr5": 332,
    "diao1": 333,
    "diao2": 334,
    "diao3": 335,
    "diao4": 336,
    "diao5": 337,
    "die1": 338,
    "die2": 339,
    "die3": 340,
    "die4": 341,
    "die5": 342,
    "din4": 343,
    "ding1": 344,
    "ding2": 345,
    "ding3": 346,
    "ding4": 347,
    "ding5": 348,
    "dir2": 349,
    "dir3": 350,
    "dir4": 351,
    "diu1": 352,
    "diu4": 353,
    "dong1": 354,
    "dong2": 355,
    "dong3": 356,
    "dong4": 357,
    "dong5": 358,
    "dou1": 359,
    "dou2": 360,
    "dou3": 361,
    "dou4": 362,
    "dou5": 363,
    "dour4": 364,
    "du1": 365,
    "du2": 366,
    "du3": 367,
    "du4": 368,
    "du5": 369,
    "duan1": 370,
    "duan2": 371,
    "duan3": 372,
    "duan4": 373,
    "duan5": 374,
    "duanr4": 375,
    "dui1": 376,
    "dui4": 377,
    "duir1": 378,
    "duir4": 379,
    "dun1": 380,
    "dun2": 381,
    "dun3": 382,
    "dun4": 383,
    "dun5": 384,
    "dunr1": 385,
    "dunr3": 386,
    "duo1": 387,
    "duo2": 388,
    "duo3": 389,
    "duo4": 390,
    "duo5": 391,
    "duor3": 392,
    "e1": 393,
    "e2": 394,
    "e3": 395,
    "e4": 396,
    "e5": 397,
    "ei1": 398,
    "ei5": 399,
    "en1": 400,
    "en2": 401,
    "en4": 402,
    "en5": 403,
    "eng2": 404,
    "eng4": 405,
    "er1": 406,
    "er2": 407,
    "er3": 408,
    "er4": 409,
    "er5": 410,
    "fa1": 411,
    "fa2": 412,
    "fa3": 413,
    "fa4": 414,
    "fa5": 415,
    "fan1": 416,
    "fan2": 417,
    "fan3": 418,
    "fan4": 419,
    "fan5": 420,
    "fang1": 421,
    "fang2": 422,
    "fang3": 423,
    "fang4": 424,
    "fang5": 425,
    "fangr4": 426,
    "fanr4": 427,
    "far2": 428,
    "far3": 429,
    "fei1": 430,
    "fei2": 431,
    "fei3": 432,
    "fei4": 433,
    "fen1": 434,
    "fen2": 435,
    "fen3": 436,
    "fen4": 437,
    "fen5": 438,
    "feng1": 439,
    "feng2": 440,
    "feng3": 441,
    "feng4": 442,
    "feng5": 443,
    "fenr1": 444,
    "fenr4": 445,
    "fenr5": 446,
    "fo2": 447,
    "fou2": 448,
    "fou3": 449,
    "fu1": 450,
    "fu2": 451,
    "fu3": 452,
    "fu4": 453,
    "fu5": 454,
    "fur4": 455,
    "fur5": 456,
    "ga1": 457,
    "ga2": 458,
    "ga3": 459,
    "ga4": 460,
    "gai1": 461,
    "gai2": 462,
    "gai3": 463,
    "gai4": 464,
    "gair4": 465,
    "gan1": 466,
    "gan2": 467,
    "gan3": 468,
    "gan4": 469,
    "gan5": 470,
    "gang1": 471,
    "gang2": 472,
    "gang3": 473,
    "gang4": 474,
    "gang5": 475,
    "ganr1": 476,
    "ganr3": 477,
    "gao1": 478,
    "gao2": 479,
    "gao3": 480,
    "gao4": 481,
    "gaor1": 482,
    "gaor3": 483,
    "gaor4": 484,
    "ge1": 485,
    "ge2": 486,
    "ge3": 487,
    "ge4": 488,
    "ge5": 489,
    "gei1": 490,
    "gei2": 491,
    "gei3": 492,
    "gei5": 493,
    "gen1": 494,
    "gen3": 495,
    "gen4": 496,
    "geng1": 497,
    "geng2": 498,
    "geng3": 499,
    "geng4": 500,
    "genr1": 501,
    "ger1": 502,
    "ger2": 503,
    "ger3": 504,
    "ger4": 505,
    "ger5": 506,
    "gong1": 507,
    "gong2": 508,
    "gong3": 509,
    "gong4": 510,
    "gong5": 511,
    "gou1": 512,
    "gou2": 513,
    "gou3": 514,
    "gou4": 515,
    "gou5": 516,
    "gour3": 517,
    "gu1": 518,
    "gu2": 519,
    "gu3": 520,
    "gu4": 521,
    "gu5": 522,
    "gua1": 523,
    "gua2": 524,
    "gua3": 525,
    "gua4": 526,
    "gua5": 527,
    "guai1": 528,
    "guai2": 529,
    "guai3": 530,
    "guai4": 531,
    "guan1": 532,
    "guan2": 533,
    "guan3": 534,
    "guan4": 535,
    "guang1": 536,
    "guang2": 537,
    "guang3": 538,
    "guang4": 539,
    "guang5": 540,
    "guanr2": 541,
    "guanr3": 542,
    "guanr4": 543,
    "guar4": 544,
    "gui1": 545,
    "gui2": 546,
    "gui3": 547,
    "gui4": 548,
    "gui5": 549,
    "gun1": 550,
    "gun2": 551,
    "gun3": 552,
    "gun4": 553,
    "gunr4": 554,
    "guo1": 555,
    "guo2": 556,
    "guo3": 557,
    "guo4": 558,
    "guo5": 559,
    "guor1": 560,
    "guor3": 561,
    "ha1": 562,
    "ha2": 563,
    "ha4": 564,
    "ha5": 565,
    "hai1": 566,
    "hai2": 567,
    "hai3": 568,
    "hai4": 569,
    "hai5": 570,
    "hair2": 571,
    "han1": 572,
    "han2": 573,
    "han3": 574,
    "han4": 575,
    "han5": 576,
    "hang1": 577,
    "hang2": 578,
    "hang3": 579,
    "hang4": 580,
    "hangr2": 581,
    "hanr4": 582,
    "hao1": 583,
    "hao2": 584,
    "hao3": 585,
    "hao4": 586,
    "hao5": 587,
    "haor1": 588,
    "haor3": 589,
    "haor4": 590,
    "haor5": 591,
    "he1": 592,
    "he2": 593,
    "he3": 594,
    "he4": 595,
    "he5": 596,
    "hei1": 597,
    "hei2": 598,
    "hei4": 599,
    "hen1": 600,
    "hen2": 601,
    "hen3": 602,
    "hen4": 603,
    "heng1": 604,
    "heng2": 605,
    "heng3": 606,
    "heng4": 607,
    "heng5": 608,
    "her2": 609,
    "hong1": 610,
    "hong2": 611,
    "hong3": 612,
    "hong4": 613,
    "hou1": 614,
    "hou2": 615,
    "hou3": 616,
    "hou4": 617,
    "hou5": 618,
    "hour4": 619,
    "hour5": 620,
    "hu1": 621,
    "hu2": 622,
    "hu3": 623,
    "hu4": 624,
    "hu5": 625,
    "hua1": 626,
    "hua2": 627,
    "hua3": 628,
    "hua4": 629,
    "hua5": 630,
    "huai1": 631,
    "huai2": 632,
    "huai3": 633,
    "huai4": 634,
    "huan1": 635,
    "huan2": 636,
    "huan3": 637,
    "huan4": 638,
    "huan5": 639,
    "huang1": 640,
    "huang2": 641,
    "huang3": 642,
    "huang4": 643,
    "huang5": 644,
    "huanr1": 645,
    "huanr2": 646,
    "huar1": 647,
    "huar2": 648,
    "huar4": 649,
    "hui1": 650,
    "hui2": 651,
    "hui3": 652,
    "hui4": 653,
    "hui5": 654,
    "huir2": 655,
    "huir3": 656,
    "huir4": 657,
    "hun1": 658,
    "hun2": 659,
    "hun3": 660,
    "hun4": 661,
    "hun5": 662,
    "huo1": 663,
    "huo2": 664,
    "huo3": 665,
    "huo4": 666,
    "huo5": 667,
    "huor2": 668,
    "huor3": 669,
    "huor5": 670,
    "hur4": 671,
    "ji1": 672,
    "ji2": 673,
    "ji3": 674,
    "ji4": 675,
    "ji5": 676,
    "jia1": 677,
    "jia2": 678,
    "jia3": 679,
    "jia4": 680,
    "jia5": 681,
    "jian1": 682,
    "jian2": 683,
    "jian3": 684,
    "jian4": 685,
    "jian5": 686,
    "jiang1": 687,
    "jiang2": 688,
    "jiang3": 689,
    "jiang4": 690,
    "jiang5": 691,
    "jianr4": 692,
    "jiao1": 693,
    "jiao2": 694,
    "jiao3": 695,
    "jiao4": 696,
    "jiao5": 697,
    "jiar1": 698,
    "jiar4": 699,
    "jie1": 700,
    "jie2": 701,
    "jie3": 702,
    "jie4": 703,
    "jie5": 704,
    "jin1": 705,
    "jin2": 706,
    "jin3": 707,
    "jin4": 708,
    "jin5": 709,
    "jing1": 710,
    "jing2": 711,
    "jing3": 712,
    "jing4": 713,
    "jing5": 714,
    "jingr3": 715,
    "jingr4": 716,
    "jinr1": 717,
    "jinr4": 718,
    "jiong1": 719,
    "jiong2": 720,
    "jiong3": 721,
    "jiong4": 722,
    "jir1": 723,
    "jiu1": 724,
    "jiu2": 725,
    "jiu3": 726,
    "jiu4": 727,
    "jiu5": 728,
    "ju1": 729,
    "ju2": 730,
    "ju3": 731,
    "ju4": 732,
    "ju5": 733,
    "juan1": 734,
    "juan2": 735,
    "juan3": 736,
    "juan4": 737,
    "juanr3": 738,
    "juanr4": 739,
    "jue1": 740,
    "jue2": 741,
    "jue3": 742,
    "jue4": 743,
    "jue5": 744,
    "juer2": 745,
    "juer3": 746,
    "jun1": 747,
    "jun3": 748,
    "jun4": 749,
    "jun5": 750,
    "jv4": 751,
    "ka1": 752,
    "ka2": 753,
    "ka3": 754,
    "ka4": 755,
    "kai1": 756,
    "kai2": 757,
    "kai3": 758,
    "kai4": 759,
    "kai5": 760,
    "kan1": 761,
    "kan2": 762,
    "kan3": 763,
    "kan4": 764,
    "kan5": 765,
    "kang1": 766,
    "kang2": 767,
    "kang3": 768,
    "kang4": 769,
    "kanr3": 770,
    "kao1": 771,
    "kao2": 772,
    "kao3": 773,
    "kao4": 774,
    "ke1": 775,
    "ke2": 776,
    "ke3": 777,
    "ke4": 778,
    "ke5": 779,
    "ken1": 780,
    "ken2": 781,
    "ken3": 782,
    "keng1": 783,
    "keng2": 784,
    "keng3": 785,
    "ker1": 786,
    "ker2": 787,
    "ker3": 788,
    "ker4": 789,
    "kong1": 790,
    "kong2": 791,
    "kong3": 792,
    "kong4": 793,
    "kou1": 794,
    "kou2": 795,
    "kou3": 796,
    "kou4": 797,
    "kou5": 798,
    "kour3": 799,
    "ku1": 800,
    "ku2": 801,
    "ku3": 802,
    "ku4": 803,
    "ku5": 804,
    "kua1": 805,
    "kua2": 806,
    "kua3": 807,
    "kua4": 808,
    "kuai3": 809,
    "kuai4": 810,
    "kuai5": 811,
    "kuair4": 812,
    "kuair5": 813,
    "kuan1": 814,
    "kuan2": 815,
    "kuan3": 816,
    "kuan4": 817,
    "kuang1": 818,
    "kuang2": 819,
    "kuang3": 820,
    "kuang4": 821,
    "kuang5": 822,
    "kui1": 823,
    "kui2": 824,
    "kui3": 825,
    "kui4": 826,
    "kun1": 827,
    "kun2": 828,
    "kun3": 829,
    "kun4": 830,
    "kuo4": 831,
    "la1": 832,
    "la2": 833,
    "la3": 834,
    "la4": 835,
    "la5": 836,
    "lai1": 837,
    "lai2": 838,
    "lai3": 839,
    "lai4": 840,
    "lai5": 841,
    "lan1": 842,
    "lan2": 843,
    "lan3": 844,
    "lan4": 845,
    "lan5": 846,
    "lang1": 847,
    "lang2": 848,
    "lang3": 849,
    "lang4": 850,
    "lang5": 851,
    "langr4": 852,
    "lanr4": 853,
    "lao1": 854,
    "lao2": 855,
    "lao3": 856,
    "lao4": 857,
    "lao5": 858,
    "lar3": 859,
    "le1": 860,
    "le2": 861,
    "le3": 862,
    "le4": 863,
    "le5": 864,
    "lei1": 865,
    "lei2": 866,
    "lei3": 867,
    "lei4": 868,
    "lei5": 869,
    "leng1": 870,
    "leng2": 871,
    "leng3": 872,
    "leng4": 873,
    "ler4": 874,
    "li1": 875,
    "li2": 876,
    "li3": 877,
    "li4": 878,
    "li5": 879,
    "lia2": 880,
    "lia3": 881,
    "lian1": 882,
    "lian2": 883,
    "lian3": 884,
    "lian4": 885,
    "lian5": 886,
    "liang1": 887,
    "liang2": 888,
    "liang3": 889,
    "liang4": 890,
    "liang5": 891,
    "lianr2": 892,
    "lianr3": 893,
    "lianr4": 894,
    "liao1": 895,
    "liao2": 896,
    "liao3": 897,
    "liao4": 898,
    "liao5": 899,
    "liaor2": 900,
    "liaor4": 901,
    "liar3": 902,
    "lie1": 903,
    "lie2": 904,
    "lie3": 905,
    "lie4": 906,
    "lie5": 907,
    "lin1": 908,
    "lin2": 909,
    "lin3": 910,
    "lin4": 911,
    "lin5": 912,
    "ling1": 913,
    "ling2": 914,
    "ling3": 915,
    "ling4": 916,
    "ling5": 917,
    "lir3": 918,
    "lir4": 919,
    "liu1": 920,
    "liu2": 921,
    "liu3": 922,
    "liu4": 923,
    "liu5": 924,
    "liur1": 925,
    "liur2": 926,
    "lo5": 927,
    "long2": 928,
    "long3": 929,
    "long4": 930,
    "long5": 931,
    "lou1": 932,
    "lou2": 933,
    "lou3": 934,
    "lou4": 935,
    "lou5": 936,
    "lu1": 937,
    "lu2": 938,
    "lu3": 939,
    "lu4": 940,
    "lu5": 941,
    "luan2": 942,
    "luan3": 943,
    "luan4": 944,
    "lun1": 945,
    "lun2": 946,
    "lun4": 947,
    "lunr2": 948,
    "luo1": 949,
    "luo2": 950,
    "luo3": 951,
    "luo4": 952,
    "luo5": 953,
    "lv2": 954,
    "lv3": 955,
    "lv4": 956,
    "lv5": 957,
    "lve4": 958,
    "ma1": 959,
    "ma2": 960,
    "ma3": 961,
    "ma4": 962,
    "ma5": 963,
    "mai1": 964,
    "mai2": 965,
    "mai3": 966,
    "mai4": 967,
    "mai5": 968,
    "man1": 969,
    "man2": 970,
    "man3": 971,
    "man4": 972,
    "man5": 973,
    "mang1": 974,
    "mang2": 975,
    "mang3": 976,
    "mang4": 977,
    "mao1": 978,
    "mao2": 979,
    "mao3": 980,
    "mao4": 981,
    "mao5": 982,
    "maor2": 983,
    "mar3": 984,
    "me1": 985,
    "me2": 986,
    "me3": 987,
    "me4": 988,
    "me5": 989,
    "mei1": 990,
    "mei2": 991,
    "mei3": 992,
    "mei4": 993,
    "mei5": 994,
    "men1": 995,
    "men2": 996,
    "men3": 997,
    "men4": 998,
    "men5": 999,
    "meng1": 1000,
    "meng2": 1001,
    "meng3": 1002,
    "meng4": 1003,
    "meng5": 1004,
    "menr2": 1005,
    "menr5": 1006,
    "mi1": 1007,
    "mi2": 1008,
    "mi3": 1009,
    "mi4": 1010,
    "mi5": 1011,
    "mian1": 1012,
    "mian2": 1013,
    "mian3": 1014,
    "mian4": 1015,
    "mian5": 1016,
    "mianr4": 1017,
    "miao1": 1018,
    "miao2": 1019,
    "miao3": 1020,
    "miao4": 1021,
    "miaor4": 1022,
    "mie1": 1023,
    "mie2": 1024,
    "mie4": 1025,
    "min2": 1026,
    "min3": 1027,
    "min4": 1028,
    "min5": 1029,
    "ming1": 1030,
    "ming2": 1031,
    "ming3": 1032,
    "ming4": 1033,
    "ming5": 1034,
    "mingr2": 1035,
    "miu3": 1036,
    "miu4": 1037,
    "mo1": 1038,
    "mo2": 1039,
    "mo3": 1040,
    "mo4": 1041,
    "mo5": 1042,
    "mor2": 1043,
    "mou2": 1044,
    "mou3": 1045,
    "mou5": 1046,
    "mu1": 1047,
    "mu2": 1048,
    "mu3": 1049,
    "mu4": 1050,
    "mu5": 1051,
    "mur4": 1052,
    "mur5": 1053,
    "na1": 1054,
    "na2": 1055,
    "na3": 1056,
    "na4": 1057,
    "na5": 1058,
    "nai2": 1059,
    "nai3": 1060,
    "nai4": 1061,
    "nai5": 1062,
    "nan1": 1063,
    "nan2": 1064,
    "nan3": 1065,
    "nan4": 1066,
    "nan5": 1067,
    "nang1": 1068,
    "nang2": 1069,
    "nang4": 1070,
    "nang5": 1071,
    "nao1": 1072,
    "nao2": 1073,
    "nao3": 1074,
    "nao4": 1075,
    "nao5": 1076,
    "naor2": 1077,
    "naor3": 1078,
    "nar2": 1079,
    "nar3": 1080,
    "nar4": 1081,
    "nar5": 1082,
    "ne1": 1083,
    "ne2": 1084,
    "ne4": 1085,
    "ne5": 1086,
    "nei1": 1087,
    "nei3": 1088,
    "nei4": 1089,
    "nen2": 1090,
    "nen4": 1091,
    "nen5": 1092,
    "neng2": 1093,
    "neng3": 1094,
    "neng4": 1095,
    "neng5": 1096,
    "ng1": 1097,
    "ni1": 1098,
    "ni2": 1099,
    "ni3": 1100,
    "ni4": 1101,
    "ni5": 1102,
    "nian1": 1103,
    "nian2": 1104,
    "nian3": 1105,
    "nian4": 1106,
    "nian5": 1107,
    "niang1": 1108,
    "niang2": 1109,
    "niang3": 1110,
    "niang4": 1111,
    "niang5": 1112,
    "niangr2": 1113,
    "niao1": 1114,
    "niao2": 1115,
    "niao3": 1116,
    "niao4": 1117,
    "nie1": 1118,
    "nie2": 1119,
    "nie4": 1120,
    "nin2": 1121,
    "nin3": 1122,
    "nin4": 1123,
    "ning1": 1124,
    "ning2": 1125,
    "ning3": 1126,
    "ning4": 1127,
    "nir3": 1128,
    "niu1": 1129,
    "niu2": 1130,
    "niu3": 1131,
    "niu4": 1132,
    "niu5": 1133,
    "niur1": 1134,
    "niur2": 1135,
    "nong2": 1136,
    "nong4": 1137,
    "nong5": 1138,
    "nu1": 1139,
    "nu2": 1140,
    "nu3": 1141,
    "nu4": 1142,
    "nuan2": 1143,
    "nuan3": 1144,
    "nuan4": 1145,
    "nuo2": 1146,
    "nuo4": 1147,
    "nv2": 1148,
    "nv3": 1149,
    "nv4": 1150,
    "nv5": 1151,
    "nve4": 1152,
    "nvr3": 1153,
    "o1": 1154,
    "o2": 1155,
    "o4": 1156,
    "o5": 1157,
    "ou1": 1158,
    "ou2": 1159,
    "ou3": 1160,
    "ou4": 1161,
    "pa1": 1162,
    "pa2": 1163,
    "pa3": 1164,
    "pa4": 1165,
    "pa5": 1166,
    "pai1": 1167,
    "pai2": 1168,
    "pai3": 1169,
    "pai4": 1170,
    "pai5": 1171,
    "pair2": 1172,
    "pair4": 1173,
    "pan1": 1174,
    "pan2": 1175,
    "pan4": 1176,
    "pan5": 1177,
    "pang1": 1178,
    "pang2": 1179,
    "pang4": 1180,
    "pang5": 1181,
    "pao1": 1182,
    "pao2": 1183,
    "pao3": 1184,
    "pao4": 1185,
    "pao5": 1186,
    "paor3": 1187,
    "paor4": 1188,
    "pei1": 1189,
    "pei2": 1190,
    "pei3": 1191,
    "pei4": 1192,
    "pei5": 1193,
    "pen1": 1194,
    "pen2": 1195,
    "pen4": 1196,
    "peng1": 1197,
    "peng2": 1198,
    "peng3": 1199,
    "peng4": 1200,
    "peng5": 1201,
    "pi1": 1202,
    "pi2": 1203,
    "pi3": 1204,
    "pi4": 1205,
    "pi5": 1206,
    "pian1": 1207,
    "pian2": 1208,
    "pian4": 1209,
    "pian5": 1210,
    "pianr1": 1211,
    "pianr4": 1212,
    "piao1": 1213,
    "piao2": 1214,
    "piao3": 1215,
    "piao4": 1216,
    "piao5": 1217,
    "pie1": 1218,
    "pie2": 1219,
    "pie3": 1220,
    "pin1": 1221,
    "pin2": 1222,
    "pin3": 1223,
    "pin4": 1224,
    "pin5": 1225,
    "ping1": 1226,
    "ping2": 1227,
    "ping3": 1228,
    "ping4": 1229,
    "ping5": 1230,
    "pingr2": 1231,
    "pir2": 1232,
    "po1": 1233,
    "po2": 1234,
    "po3": 1235,
    "po4": 1236,
    "po5": 1237,
    "por2": 1238,
    "pou1": 1239,
    "pu1": 1240,
    "pu2": 1241,
    "pu3": 1242,
    "pu4": 1243,
    "pu5": 1244,
    "pur1": 1245,
    "pur2": 1246,
    "qi1": 1247,
    "qi2": 1248,
    "qi3": 1249,
    "qi4": 1250,
    "qi5": 1251,
    "qia1": 1252,
    "qia2": 1253,
    "qia3": 1254,
    "qia4": 1255,
    "qia5": 1256,
    "qian1": 1257,
    "qian2": 1258,
    "qian3": 1259,
    "qian4": 1260,
    "qian5": 1261,
    "qiang1": 1262,
    "qiang2": 1263,
    "qiang3": 1264,
    "qiang4": 1265,
    "qiang5": 1266,
    "qianr1": 1267,
    "qiao1": 1268,
    "qiao2": 1269,
    "qiao3": 1270,
    "qiao4": 1271,
    "qiao5": 1272,
    "qie1": 1273,
    "qie2": 1274,
    "qie3": 1275,
    "qie4": 1276,
    "qie5": 1277,
    "qin1": 1278,
    "qin2": 1279,
    "qin3": 1280,
    "qin4": 1281,
    "qin5": 1282,
    "qing1": 1283,
    "qing2": 1284,
    "qing3": 1285,
    "qing4": 1286,
    "qing5": 1287,
    "qingr4": 1288,
    "qiong2": 1289,
    "qir4": 1290,
    "qiu1": 1291,
    "qiu2": 1292,
    "qiu3": 1293,
    "qiu5": 1294,
    "qiur2": 1295,
    "qu1": 1296,
    "qu2": 1297,
    "qu3": 1298,
    "qu4": 1299,
    "qu5": 1300,
    "quan1": 1301,
    "quan2": 1302,
    "quan3": 1303,
    "quan4": 1304,
    "quan5": 1305,
    "quanr1": 1306,
    "quanr4": 1307,
    "que1": 1308,
    "que2": 1309,
    "que4": 1310,
    "qun1": 1311,
    "qun2": 1312,
    "qun3": 1313,
    "qun4": 1314,
    "qunr2": 1315,
    "ran1": 1316,
    "ran2": 1317,
    "ran3": 1318,
    "ran4": 1319,
    "ran5": 1320,
    "rang1": 1321,
    "rang2": 1322,
    "rang3": 1323,
    "rang4": 1324,
    "rang5": 1325,
    "rao2": 1326,
    "rao3": 1327,
    "rao4": 1328,
    "re2": 1329,
    "re3": 1330,
    "re4": 1331,
    "ren1": 1332,
    "ren2": 1333,
    "ren3": 1334,
    "ren4": 1335,
    "ren5": 1336,
    "reng1": 1337,
    "reng2": 1338,
    "reng3": 1339,
    "reng4": 1340,
    "renr2": 1341,
    "renr4": 1342,
    "ri2": 1343,
    "ri4": 1344,
    "rong2": 1345,
    "rong3": 1346,
    "rong4": 1347,
    "rong5": 1348,
    "rou2": 1349,
    "rou3": 1350,
    "rou4": 1351,
    "rou5": 1352,
    "ru1": 1353,
    "ru2": 1354,
    "ru3": 1355,
    "ru4": 1356,
    "ruan2": 1357,
    "ruan3": 1358,
    "ruan4": 1359,
    "rui2": 1360,
    "rui3": 1361,
    "rui4": 1362,
    "run2": 1363,
    "run3": 1364,
    "run4": 1365,
    "run5": 1366,
    "ruo1": 1367,
    "ruo4": 1368,
    "ruo5": 1369,
    "sa1": 1370,
    "sa2": 1371,
    "sa3": 1372,
    "sa4": 1373,
    "sa5": 1374,
    "sai1": 1375,
    "sai2": 1376,
    "sai3": 1377,
    "sai4": 1378,
    "sai5": 1379,
    "san1": 1380,
    "san2": 1381,
    "san3": 1382,
    "san4": 1383,
    "sang1": 1384,
    "sang2": 1385,
    "sang3": 1386,
    "sang4": 1387,
    "sanr1": 1388,
    "sao1": 1389,
    "sao2": 1390,
    "sao3": 1391,
    "sao4": 1392,
    "sao5": 1393,
    "se2": 1394,
    "se4": 1395,
    "se5": 1396,
    "sen1": 1397,
    "sen2": 1398,
    "sen3": 1399,
    "sen4": 1400,
    "sen5": 1401,
    "seng1": 1402,
    "seng3": 1403,
    "seng4": 1404,
    "sha1": 1405,
    "sha2": 1406,
    "sha3": 1407,
    "sha4": 1408,
    "sha5": 1409,
    "shai1": 1410,
    "shai2": 1411,
    "shai3": 1412,
    "shai4": 1413,
    "shai5": 1414,
    "shan1": 1415,
    "shan2": 1416,
    "shan3": 1417,
    "shan4": 1418,
    "shan5": 1419,
    "shang1": 1420,
    "shang2": 1421,
    "shang3": 1422,
    "shang4": 1423,
    "shang5": 1424,
    "shanr1": 1425,
    "shao1": 1426,
    "shao2": 1427,
    "shao3": 1428,
    "shao4": 1429,
    "shao5": 1430,
    "shaor2": 1431,
    "she1": 1432,
    "she2": 1433,
    "she3": 1434,
    "she4": 1435,
    "shei1": 1436,
    "shei2": 1437,
    "shei3": 1438,
    "shen1": 1439,
    "shen2": 1440,
    "shen3": 1441,
    "shen4": 1442,
    "shen5": 1443,
    "sheng1": 1444,
    "sheng2": 1445,
    "sheng3": 1446,
    "sheng4": 1447,
    "sheng5": 1448,
    "shengr1": 1449,
    "sher4": 1450,
    "shi1": 1451,
    "shi2": 1452,
    "shi3": 1453,
    "shi4": 1454,
    "shi5": 1455,
    "shir4": 1456,
    "shou1": 1457,
    "shou2": 1458,
    "shou3": 1459,
    "shou4": 1460,
    "shou5": 1461,
    "shour3": 1462,
    "shu1": 1463,
    "shu2": 1464,
    "shu3": 1465,
    "shu4": 1466,
    "shu5": 1467,
    "shua1": 1468,
    "shua2": 1469,
    "shua3": 1470,
    "shua4": 1471,
    "shuai1": 1472,
    "shuai2": 1473,
    "shuai3": 1474,
    "shuai4": 1475,
    "shuai5": 1476,
    "shuan1": 1477,
    "shuan2": 1478,
    "shuan4": 1479,
    "shuan5": 1480,
    "shuang1": 1481,
    "shuang2": 1482,
    "shuang3": 1483,
    "shuang4": 1484,
    "shuar1": 1485,
    "shui1": 1486,
    "shui2": 1487,
    "shui3": 1488,
    "shui4": 1489,
    "shui5": 1490,
    "shuir2": 1491,
    "shuir3": 1492,
    "shun1": 1493,
    "shun2": 1494,
    "shun3": 1495,
    "shun4": 1496,
    "shun5": 1497,
    "shuo1": 1498,
    "shuo2": 1499,
    "shuo3": 1500,
    "shuo4": 1501,
    "shuo5": 1502,
    "shuor1": 1503,
    "shur4": 1504,
    "si1": 1505,
    "si2": 1506,
    "si3": 1507,
    "si4": 1508,
    "si5": 1509,
    "song1": 1510,
    "song2": 1511,
    "song3": 1512,
    "song4": 1513,
    "sou1": 1514,
    "sou2": 1515,
    "sou3": 1516,
    "sou4": 1517,
    "sou5": 1518,
    "su1": 1519,
    "su2": 1520,
    "su3": 1521,
    "su4": 1522,
    "su5": 1523,
    "suan1": 1524,
    "suan2": 1525,
    "suan3": 1526,
    "suan4": 1527,
    "suan5": 1528,
    "sui1": 1529,
    "sui2": 1530,
    "sui3": 1531,
    "sui4": 1532,
    "sun1": 1533,
    "sun2": 1534,
    "sun3": 1535,
    "sun4": 1536,
    "suo1": 1537,
    "suo2": 1538,
    "suo3": 1539,
    "suo4": 1540,
    "suo5": 1541,
    "suor3": 1542,
    "ta1": 1543,
    "ta2": 1544,
    "ta3": 1545,
    "ta4": 1546,
    "ta5": 1547,
    "tai1": 1548,
    "tai2": 1549,
    "tai3": 1550,
    "tai4": 1551,
    "tai5": 1552,
    "tan1": 1553,
    "tan2": 1554,
    "tan3": 1555,
    "tan4": 1556,
    "tan5": 1557,
    "tang1": 1558,
    "tang2": 1559,
    "tang3": 1560,
    "tang4": 1561,
    "tang5": 1562,
    "tanr1": 1563,
    "tao1": 1564,
    "tao2": 1565,
    "tao3": 1566,
    "tao4": 1567,
    "tao5": 1568,
    "taor2": 1569,
    "te2": 1570,
    "te3": 1571,
    "te4": 1572,
    "te5": 1573,
    "tei1": 1574,
    "teng1": 1575,
    "teng2": 1576,
    "teng4": 1577,
    "teng5": 1578,
    "ter4": 1579,
    "ti1": 1580,
    "ti2": 1581,
    "ti3": 1582,
    "ti4": 1583,
    "ti5": 1584,
    "tian1": 1585,
    "tian2": 1586,
    "tian3": 1587,
    "tian4": 1588,
    "tian5": 1589,
    "tianr1": 1590,
    "tiao1": 1591,
    "tiao2": 1592,
    "tiao3": 1593,
    "tiao4": 1594,
    "tiao5": 1595,
    "tiaor2": 1596,
    "tie1": 1597,
    "tie2": 1598,
    "tie3": 1599,
    "tie4": 1600,
    "ting1": 1601,
    "ting2": 1602,
    "ting3": 1603,
    "ting5": 1604,
    "tong1": 1605,
    "tong2": 1606,
    "tong3": 1607,
    "tong4": 1608,
    "tong5": 1609,
    "tongr4": 1610,
    "tou1": 1611,
    "tou2": 1612,
    "tou3": 1613,
    "tou4": 1614,
    "tou5": 1615,
    "tour2": 1616,
    "tu1": 1617,
    "tu2": 1618,
    "tu3": 1619,
    "tu4": 1620,
    "tu5": 1621,
    "tuan1": 1622,
    "tuan2": 1623,
    "tuan3": 1624,
    "tuan4": 1625,
    "tuan5": 1626,
    "tui1": 1627,
    "tui2": 1628,
    "tui3": 1629,
    "tui4": 1630,
    "tui5": 1631,
    "tuir3": 1632,
    "tun1": 1633,
    "tun2": 1634,
    "tun4": 1635,
    "tun5": 1636,
    "tunr2": 1637,
    "tuo1": 1638,
    "tuo2": 1639,
    "tuo3": 1640,
    "tuo4": 1641,
    "tuo5": 1642,
    "tuor1": 1643,
    "tuor3": 1644,
    "tur2": 1645,
    "wa1": 1646,
    "wa2": 1647,
    "wa3": 1648,
    "wa4": 1649,
    "wa5": 1650,
    "wai1": 1651,
    "wai2": 1652,
    "wai3": 1653,
    "wai4": 1654,
    "wan1": 1655,
    "wan2": 1656,
    "wan3": 1657,
    "wan4": 1658,
    "wan5": 1659,
    "wang1": 1660,
    "wang2": 1661,
    "wang3": 1662,
    "wang4": 1663,
    "wang5": 1664,
    "wangr2": 1665,
    "wangr4": 1666,
    "wanr1": 1667,
    "wanr2": 1668,
    "wanr4": 1669,
    "wanr5": 1670,
    "wei1": 1671,
    "wei2": 1672,
    "wei3": 1673,
    "wei4": 1674,
    "wei5": 1675,
    "weir4": 1676,
    "wen1": 1677,
    "wen2": 1678,
    "wen3": 1679,
    "wen4": 1680,
    "wen5": 1681,
    "weng1": 1682,
    "weng2": 1683,
    "weng3": 1684,
    "weng4": 1685,
    "weng5": 1686,
    "wenr2": 1687,
    "wo1": 1688,
    "wo2": 1689,
    "wo3": 1690,
    "wo4": 1691,
    "wo5": 1692,
    "wu1": 1693,
    "wu2": 1694,
    "wu3": 1695,
    "wu4": 1696,
    "wu5": 1697,
    "wur3": 1698,
    "xi1": 1699,
    "xi2": 1700,
    "xi3": 1701,
    "xi4": 1702,
    "xi5": 1703,
    "xia1": 1704,
    "xia2": 1705,
    "xia3": 1706,
    "xia4": 1707,
    "xia5": 1708,
    "xian1": 1709,
    "xian2": 1710,
    "xian3": 1711,
    "xian4": 1712,
    "xiang1": 1713,
    "xiang2": 1714,
    "xiang3": 1715,
    "xiang4": 1716,
    "xiang5": 1717,
    "xianr4": 1718,
    "xiao1": 1719,
    "xiao2": 1720,
    "xiao3": 1721,
    "xiao4": 1722,
    "xiao5": 1723,
    "xiaor3": 1724,
    "xie1": 1725,
    "xie2": 1726,
    "xie3": 1727,
    "xie4": 1728,
    "xie5": 1729,
    "xin1": 1730,
    "xin2": 1731,
    "xin4": 1732,
    "xin5": 1733,
    "xing1": 1734,
    "xing2": 1735,
    "xing3": 1736,
    "xing4": 1737,
    "xing5": 1738,
    "xingr2": 1739,
    "xingr4": 1740,
    "xiong1": 1741,
    "xiong2": 1742,
    "xiong4": 1743,
    "xiong5": 1744,
    "xir1": 1745,
    "xiu1": 1746,
    "xiu2": 1747,
    "xiu3": 1748,
    "xiu4": 1749,
    "xu1": 1750,
    "xu2": 1751,
    "xu3": 1752,
    "xu4": 1753,
    "xu5": 1754,
    "xuan1": 1755,
    "xuan2": 1756,
    "xuan3": 1757,
    "xuan4": 1758,
    "xue1": 1759,
    "xue2": 1760,
    "xue3": 1761,
    "xue4": 1762,
    "xuer3": 1763,
    "xun1": 1764,
    "xun2": 1765,
    "xun3": 1766,
    "xun4": 1767,
    "xun5": 1768,
    "ya1": 1769,
    "ya2": 1770,
    "ya3": 1771,
    "ya4": 1772,
    "ya5": 1773,
    "yan1": 1774,
    "yan2": 1775,
    "yan3": 1776,
    "yan4": 1777,
    "yang1": 1778,
    "yang2": 1779,
    "yang3": 1780,
    "yang4": 1781,
    "yang5": 1782,
    "yangr4": 1783,
    "yanr2": 1784,
    "yanr3": 1785,
    "yao1": 1786,
    "yao2": 1787,
    "yao3": 1788,
    "yao4": 1789,
    "yao5": 1790,
    "ye1": 1791,
    "ye2": 1792,
    "ye3": 1793,
    "ye4": 1794,
    "ye5": 1795,
    "yer4": 1796,
    "yi1": 1797,
    "yi2": 1798,
    "yi3": 1799,
    "yi4": 1800,
    "yi5": 1801,
    "yin1": 1802,
    "yin2": 1803,
    "yin3": 1804,
    "yin4": 1805,
    "yin5": 1806,
    "ying1": 1807,
    "ying2": 1808,
    "ying3": 1809,
    "ying4": 1810,
    "ying5": 1811,
    "yingr1": 1812,
    "yingr2": 1813,
    "yingr3": 1814,
    "yir4": 1815,
    "yir5": 1816,
    "yo1": 1817,
    "yo3": 1818,
    "yo5": 1819,
    "yong1": 1820,
    "yong2": 1821,
    "yong3": 1822,
    "yong4": 1823,
    "yong5": 1824,
    "yongr3": 1825,
    "you1": 1826,
    "you2": 1827,
    "you3": 1828,
    "you4": 1829,
    "you5": 1830,
    "your2": 1831,
    "your3": 1832,
    "your4": 1833,
    "yu1": 1834,
    "yu2": 1835,
    "yu3": 1836,
    "yu4": 1837,
    "yu5": 1838,
    "yuan1": 1839,
    "yuan2": 1840,
    "yuan3": 1841,
    "yuan4": 1842,
    "yuan5": 1843,
    "yuanr2": 1844,
    "yuanr4": 1845,
    "yue1": 1846,
    "yue2": 1847,
    "yue4": 1848,
    "yue5": 1849,
    "yuer4": 1850,
    "yun1": 1851,
    "yun2": 1852,
    "yun3": 1853,
    "yun4": 1854,
    "yun5": 1855,
    "za1": 1856,
    "za2": 1857,
    "za3": 1858,
    "za4": 1859,
    "zai1": 1860,
    "zai2": 1861,
    "zai3": 1862,
    "zai4": 1863,
    "zai5": 1864,
    "zan1": 1865,
    "zan2": 1866,
    "zan3": 1867,
    "zan4": 1868,
    "zang1": 1869,
    "zang2": 1870,
    "zang3": 1871,
    "zang4": 1872,
    "zao1": 1873,
    "zao2": 1874,
    "zao3": 1875,
    "zao4": 1876,
    "zao5": 1877,
    "zaor3": 1878,
    "ze1": 1879,
    "ze2": 1880,
    "ze3": 1881,
    "ze4": 1882,
    "ze5": 1883,
    "zei2": 1884,
    "zei3": 1885,
    "zei4": 1886,
    "zen1": 1887,
    "zen2": 1888,
    "zen3": 1889,
    "zen4": 1890,
    "zeng1": 1891,
    "zeng2": 1892,
    "zeng3": 1893,
    "zeng4": 1894,
    "zha1": 1895,
    "zha2": 1896,
    "zha3": 1897,
    "zha4": 1898,
    "zha5": 1899,
    "zhai1": 1900,
    "zhai2": 1901,
    "zhai3": 1902,
    "zhai4": 1903,
    "zhan1": 1904,
    "zhan2": 1905,
    "zhan3": 1906,
    "zhan4": 1907,
    "zhan5": 1908,
    "zhang1": 1909,
    "zhang2": 1910,
    "zhang3": 1911,
    "zhang4": 1912,
    "zhao1": 1913,
    "zhao2": 1914,
    "zhao3": 1915,
    "zhao4": 1916,
    "zhao5": 1917,
    "zhaor1": 1918,
    "zhaor4": 1919,
    "zhe1": 1920,
    "zhe2": 1921,
    "zhe3": 1922,
    "zhe4": 1923,
    "zhe5": 1924,
    "zhei4": 1925,
    "zhen1": 1926,
    "zhen2": 1927,
    "zhen3": 1928,
    "zhen4": 1929,
    "zhen5": 1930,
    "zheng1": 1931,
    "zheng2": 1932,
    "zheng3": 1933,
    "zheng4": 1934,
    "zheng5": 1935,
    "zhengr4": 1936,
    "zher3": 1937,
    "zher4": 1938,
    "zhi1": 1939,
    "zhi2": 1940,
    "zhi3": 1941,
    "zhi4": 1942,
    "zhi5": 1943,
    "zhir1": 1944,
    "zhong1": 1945,
    "zhong2": 1946,
    "zhong3": 1947,
    "zhong4": 1948,
    "zhou1": 1949,
    "zhou2": 1950,
    "zhou3": 1951,
    "zhou4": 1952,
    "zhou5": 1953,
    "zhour4": 1954,
    "zhu1": 1955,
    "zhu2": 1956,
    "zhu3": 1957,
    "zhu4": 1958,
    "zhu5": 1959,
    "zhua1": 1960,
    "zhua3": 1961,
    "zhuai1": 1962,
    "zhuai3": 1963,
    "zhuai4": 1964,
    "zhuan1": 1965,
    "zhuan2": 1966,
    "zhuan3": 1967,
    "zhuan4": 1968,
    "zhuan5": 1969,
    "zhuang1": 1970,
    "zhuang3": 1971,
    "zhuang4": 1972,
    "zhuang5": 1973,
    "zhui1": 1974,
    "zhui3": 1975,
    "zhui4": 1976,
    "zhun1": 1977,
    "zhun2": 1978,
    "zhun3": 1979,
    "zhun4": 1980,
    "zhunr3": 1981,
    "zhuo1": 1982,
    "zhuo2": 1983,
    "zhuo3": 1984,
    "zhuo4": 1985,
    "zhuo5": 1986,
    "zhuor2": 1987,
    "zhur1": 1988,
    "zhur3": 1989,
    "zhur4": 1990,
    "zi1": 1991,
    "zi2": 1992,
    "zi3": 1993,
    "zi4": 1994,
    "zi5": 1995,
    "zong1": 1996,
    "zong2": 1997,
    "zong3": 1998,
    "zong4": 1999,
    "zong5": 2000,
    "zou1": 2001,
    "zou2": 2002,
    "zou3": 2003,
    "zou4": 2004,
    "zu1": 2005,
    "zu2": 2006,
    "zu3": 2007,
    "zu4": 2008,
    "zu5": 2009,
    "zuan1": 2010,
    "zuan2": 2011,
    "zuan3": 2012,
    "zuan4": 2013,
    "zui1": 2014,
    "zui2": 2015,
    "zui3": 2016,
    "zui4": 2017,
    "zun1": 2018,
    "zun3": 2019,
    "zun4": 2020,
    "zuo1": 2021,
    "zuo2": 2022,
    "zuo3": 2023,
    "zuo4": 2024,
    "zuo5": 2025,
    "|": 2026,
    "[UNK]": 2027,
    "[PAD]": 2028
}